ednieuw/ESP32SerialNTP-BLE-Clock/ESP32C3S3_SerialClockV009/ESP32C3S3_SerialClockV009.ino
//--------------------------------------------
// CLOCK Control the LEDs on the ESP32
// -1 leaves intensity untouched
//  0 turn LED off
//  1-255 turns LED on with intensity if available
//--------------------------------------------
void SetStatusLED(int WW, int CW, int Re, int Gr, int Bl)
{
//  sprintf(sptext,"WW:%d, CW:%d, Re:%d, Gr:%d, Bl:%d", WW,CW,Re,Gr,Bl); Tekstprintln(sptext); 

                               #ifdef ESP32C3_SUPERMINI
 if(Gr >=0 ) digitalWrite(LEDPIN, Gr);
                               #endif //ESP32C3_SUPERMINI
                               #ifdef ESP32S3_ZERO
 uint32_t color = strip.getPixelColor(0);
 if (WW <0) WW = Cwhite(color);
 if (CW <0) CW = Cwhite(color);
 if (Re <0) Re = Cred(color);
 if (Gr <0) Gr = Cgreen(color);
 if (Bl <0) Bl = Cblue(color);
 strip.setPixelColor(0, strip.Color(Re, Gr, Bl, CW)); 
 strip.show(); 
                                #endif //ESP32S3_ZERO
                                #ifdef ESP32C3_DEV 
 if(Re >=0 ) analogWrite(REDPIN,     Re);
 if(Gr >=0 ) analogWrite(GREENPIN,   Gr);
 if(Bl >=0 ) analogWrite(BLUEPIN,    Bl);
 if(CW >=0 ) analogWrite(COLD_WHITE, CW);
 if(WW >=0 ) analogWrite(WARM_WHITE, WW);
                                #endif
                                #ifdef NANOESP32 
  if(Re >0) digitalWrite(LED_RED,   LOW); 
  if(Re==0) digitalWrite(LED_RED,   HIGH);                         // LOW is On and HIGH is LED off
  if(Gr >0) digitalWrite(LED_GREEN, LOW); 
  if(Gr==0) digitalWrite(LED_GREEN, HIGH);
  if(Bl >0) digitalWrite(LED_BLUE,  LOW); 
  if(Bl==0) digitalWrite(LED_BLUE,  HIGH);
                                #endif //NANOESP32
}

//--------------------------------------------
//  LED Strip Get Pixel Color 
//--------------------------------------------
uint32_t StripGetPixelColor(int Lednr)
{
//return(strip.getPixelColor(Lednr));
return(0);
}
//--------------------------------------------                                                //
//  LED convert HSV to RGB  h is from 0-360, s,v values are 0-1
//  r,g,b values are 0-255
//--------------------------------------------
uint32_t HSVToRGB(double H, double S, double V) 
{
  int i;
  double r, g, b, f, p, q, t;
  if (S == 0)  {r = V;  g = V;  b = V; }
  else
  {
    H >= 360 ? H = 0 : H /= 60;
    i = (int) H;
    f = H - i;
    p = V * (1.0 -  S);
    q = V * (1.0 - (S * f));
    t = V * (1.0 - (S * (1.0 - f)));
    switch (i) 
    {
     case 0:  r = V;  g = t;  b = p;  break;
     case 1:  r = q;  g = V;  b = p;  break;
     case 2:  r = p;  g = V;  b = t;  break;
     case 3:  r = p;  g = q;  b = V;  break;
     case 4:  r = t;  g = p;  b = V;  break;
     default: r = V;  g = p;  b = q;  break;
    }
  }
return FuncCRGBW((int)(r*255), (int)(g*255), (int)(b*255), 0 );                                // R, G, B, W 
}
//--------------------------------------------                                                //
//  LED function to make RGBW color
//--------------------------------------------
uint32_t FuncCRGBW( uint32_t Red, uint32_t Green, uint32_t Blue, uint32_t White)
{ 
 return ( (White<<24) + (Red << 16) + (Green << 8) + Blue );
}
//--------------------------------------------                                                //
//  LED functions to extract RGBW colors
//--------------------------------------------
 uint8_t Cwhite(uint32_t c) { return (c >> 24);}
 uint8_t Cred(  uint32_t c) { return (c >> 16);}
 uint8_t Cgreen(uint32_t c) { return (c >> 8); }
 uint8_t Cblue( uint32_t c) { return (c);      }




//                                                                                            //
//--------------------------------------------
//  COMMON String upper
//--------------------------------------------
void to_upper(char* string)
{
 const char OFFSET = 'a' - 'A';
 while (*string)
  {
   (*string >= 'a' && *string <= 'z') ? *string -= OFFSET : *string;
   string++;
  }
}

//--------------------------------------------                                                //
// CLOCK Version info
//--------------------------------------------
void SWversion(void) 
{ 
 #define FILENAAM (strrchr(__FILE__, '\\') ? strrchr(__FILE__, '\\') + 1 : __FILE__)
 PrintLine(35);
 for (uint8_t i = 0; i < sizeof(menu) / sizeof(menu[0]); Tekstprintln(menu[i++]));
 PrintLine(35);
 sprintf(sptext,"SSID: %s", Mem.Ssid);                                              Tekstprintln(sptext);
// sprintf(sptext,"Password: %s", Mem.Password);                                    Tekstprintln(sptext);
 sprintf(sptext,"BLE name: %s", Mem.BLEbroadcastName);                              Tekstprintln(sptext);
 sprintf(sptext,"IP-address: %d.%d.%d.%d (/update)", 
     WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );  Tekstprintln(sptext);
 sprintf(sptext,"Timezone:%s", Mem.Timezone);                                       Tekstprintln(sptext); 
 sprintf(sptext,"%s %s %s %s", Mem.WIFIOn?"WIFI=On":"WIFI=Off", 
                               Mem.NTPOn?  "NTP=On":"NTP=Off",
                               Mem.BLEOn?  "BLE=On":"BLE=Off",
                               Mem.UseBLELongString? "FastBLE=On":"FastBLE=Off" );  Tekstprintln(sptext);

 sprintf(sptext,"Software: %s",FILENAAM);                                           Tekstprintln(sptext);  //VERSION); 
 Print_RTC_tijd(); Tekstprintln(""); 
 PrintLine(35);
}
void PrintLine(byte Lengte)
{
 for(int n=0; n<Lengte; n++) sptext[n]='_';
 sptext[Lengte] = 0;
 Tekstprintln(sptext);
}

//--------------------------- Time functions --------------------------
//--------------------------------------------                                                //
// COMMON Print T+time string   
// to the serial port
//--------------------------------------------
void PrintTimeToSerial1(void)
{
  if (timeinfo.tm_hour+timeinfo.tm_min == 0)  return;
 sprintf(sptext,"T%02d%02d%02d",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 if(Serial1) Serial1.println(sptext);
 Tekstprintln(sptext); 
}

//--------------------------------------------                                                //
// RTC Get time from NTP cq RTC 
// and store it in timeinfo struct
//--------------------------------------------
time_t GetTijd(byte printit)
{
 time_t now;
 if(Mem.NTPOn)  getLocalTime(&timeinfo);                                                   // if NTP is running get the local time
 else { time(&now); localtime_r(&now, &timeinfo);}                                            // else get the time from the internal RTC 
 if (printit)  Print_RTC_tijd();                                                              // 
 localtime(&now);
 return now;                                                                                  // return the unixtime in seconds
}
//--------------------------------------------                                                //
// RTC prints time to serial
//--------------------------------------------
void Print_RTC_tijd(void)
{
 sprintf(sptext,"%02d/%02d/%04d %02d:%02d:%02d ", 
     timeinfo.tm_mday,timeinfo.tm_mon+1,timeinfo.tm_year+1900,
     timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 Tekstprint(sptext);
}
//--------------------------------------------
// NTP print the NTP time for the timezone set 
//--------------------------------------------
void PrintNTP_tijd(void)
{
 sprintf(sptext,"%s  ", NTP.getTimeDateString());  
 Tekstprint(sptext);              // 17/10/2022 16:08:15

// int dd,mo,yy,hh,mm,ss=0;      // nice method to extract the values from a string into vaiabeles
// if (sscanf(sptext, "%2d/%2d/%4d %2d:%2d:%2d", &dd, &mo, &yy, &hh, &mm, &ss) == 6) 
//     {      sprintf(sptext,"%02d:%02d:%02d %02d-%02d-%04d", hh,mm,ss,dd,mo,yy);      Tekstprintln(sptext); }
}

